package com.frame.sxgou.model;

public enum CodeEnum {

	C200(200, "没有相关信息"), C60(60, "订单里的商品id和商品数量不是一一对应的"), C61(61, "UUID无效"), C62(
			62, "请求的对象不存在"), C63(63, "必填参数为空"), C64(64, "验证码不正确"), C65(65,
			"帐号已存在"), C66(66, "您调用的接口不存在"), C67(67, "没有您要的数据"), C68(68,
			"对象已存在"), C69(69, "参数的值不正确"), C70(70, "店铺不存在"), C71(71, "MD5校验未通过"), C72(
72, "红包无效"), C73(73, "邀请码不存在"), C74(74, "不在服务时间内(打烊)"), C75(75,
			"(异常)给自家下单"), C76(76, "部分商品已下架"), C77(77, "暂停营业"), C78(78, "银行帐号已经绑定"), C79(79, "您的店铺已经被关闭"),C80(80, "此用户未安装app"),C81(81, "此用户未登陆无法获取token"),
			C82(82, "您请求验证码太过频繁，请休息一下"),
			C83(83, "AES解密未通过"),
			C84(84, "您的账号已在别处登录"),
			C85(85, "亲，该快递单号已经存在"),
			C40(40,"未更新到操作数据"),C41(41,"密码长度有问题"),C42(42,"密码格式不对"),
			C50(50,"手机格式不对"),C51(51,"不存在当前角色"),C52(52,"未发送验证码"),C53(53,"验证码已过期"),C54(54,"不存在该手机系统1=Android2=Ios"),
			C55(55,"已经存在该用户角色"),C56(56,"该角色用户已经存在"),C57(57,"不存在该用户"),C58(58,"用户密码错误"),C59(59,"用户未拥有该角色"),
			C500(500, "系统异常"),
			
			C1000(200,""),C1001(1001,""), C1002(1002,"请输入正确的手机号码"), 
			C1003(1003,"您的手机号码已经被注册"), C1004(1004, "请输入正确的手机号码"), C1005(1005, "请输入正确的验证码"),
			C1006(1006,"验证码获取失败，请稍后在试"), C1007(1007, "您的请求太过频繁，请稍后再试"), C1008(1008, "请输入正确的验证码"),
			C1009(1009,"请输入正确的密码"), C1010(1010, "请输入正确的密码"), 
			C1014(1014, "注册成功"), C1015(1015,"请输入正确的手机号码"), C1016(1016, "您的手机号码还未注册"), 
			C1017(1017, "请输入正确的手机号码"), C1018(1018,"请输入正确的手机号码"), C1019(1019, "密码设置成功，请用新密码登陆"),
			C1040(1040,"不存在该手机系统1=Android2=Ios"),C1041(1041,"请求的对象不存在"),C1042(1042,"未发送验证码"),
			C1043(1043,"验证码已过期"),
				
			// M自提点
			C1011(1005, "请输入正确的验证码"), C1012(1012,"请输入店铺地址"), C1013(1013, "请输入联系人"), 
			C1020(1020,"快递%s-收件成功"), C1021(1021,"未申请自提，请让快递员申请快件自提"), C1022(1022,"快递已签收"),
			C1023(1023,"密码取件成功"), C1024(1024,"取件密码错误"), C1025(1025,"跳到详情页"),
			C1026(1026,"需要选择快递公司"), C1027(1027,"需要选择快递公司"), C1028(1028,"书面签收成功"),
			C1029(1029,"客户拒收成功"), C1030(1030,"无权访问此订单详情"), C1031(1031,"快递已退件"), C1032(1032,"收件超时"),
			C1033(1033,"UUID无效"), C1034(1034,"必填参数为空"), C1035(1035,"取件密码错误"),  C1036(1036,"参数的值不正确"),
			C1037(1037,"快递%s-收件成功"),C1038(1038,"未存在该商家"),C1039(1039,"状态不符，操作无效");
	
	

	private Integer code;
	private String desc;

	private CodeEnum(Integer code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public static String getNameByCode(Integer code) {
		for (CodeEnum c : CodeEnum.values()) {
			if (c.getCode().equals(code)) {
				return c.getDesc();
			}
		}
		return "请检查当前网络.";
	}

	public Integer getCode() {
		return code;
	}

	public void setCode(Integer code) {
		this.code = code;
	}

	public String getDesc() {
		return desc;
	}

	public void setDesc(String desc) {
		this.desc = desc;
	}
	
	
	public static void main(String[] args) {
		
		Integer  m  = 0;
		if(m.equals(0)){
			System.out.println("0");
		}
		if(m==0){
			System.out.println("ddd");
		}
	}

}
